<div style="font-size:18pt; padding-top:20px; text-align:center">СЕМИНАР. <b>Введение в </b> <span style="font-weight:bold; color:green">Pandas</span></div><hr>
<div style="text-align:right;">Папулин С.Ю. <span style="font-style: italic;font-weight: bold;">(papulin.study@yandex.ru)</span></div>

<a name="0"></a>
<div><span style="font-size:14pt; font-weight:bold">Содержание</span>
    <ol>
        <li><a href="#1">Основные типы данных в Pandas</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#1a">Последовательность</a></li>
                <li><a href="#1b">Табличная структура данных (DataFrame)</a></li>
            </ol>
        <li><a href="#2">Первые шаги с DataFrame</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#2a">Создание DataFrame</a></li>
                <li><a href="#2b">Обращение к элементам</a></li>
                <li><a href="#2c">Запись содержания DataFrame во внешний файл</a></li>
                <li><a href="#2d">Загрузка внешних данных в DataFrame</a></li>
            </ol>
        <li><a href="#3">Манипулирование DataFrame'ми</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#3a">Столбцы</a></li>
                <li><a href="#3b">Строки</a></li>
                <li><a href="#3c">Значения ячеек</a></li>
                <li><a href="#3d">Группировка</a></li>
                <li><a href="#3e">Сортировка</a></li>
                <li><a href="#3f">Сложные индексы</a></li>
                <li><a href="#3g">Объединение DataFrame'ов: <i>append, concat, merge, join</i></a></li>
                <li><a href="#3h">Методы <i>iterrows</i>, <i>map</i>, <i>apply</i>, <i>applymap</i></a></li>
            </ol>
        <li><a href="#4">Математическая поддержка</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#4a">Операции со столбцами</a></li>
                <li><a href="#4b">Специальные методы</a></li>
            </ol>
        <li><a href="#5">Визуализация данных</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#5a">График (plot)</a></li>
                <li><a href="#5b">Гистограмма</a></li>
            </ol>
        <li><a href="#6">Источники</a></li>
    </ol>
</div>

Подключение стилей оформления

In [1]:
%%html
<link href="css/style.css" rel="stylesheet" type="text/css">

<a name="1"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">1. Основные типы данных в <span style="font-weight:bold; color:green">Pandas</span></div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) последовательность <span style="font-weight:bold; color:green">Series</span><br> 
b) табличная структура <span style="font-weight:bold; color:green">DataFrame</span><br> 
</div>

In [2]:
import pandas as pd
import numpy as np

<a name="1a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Последовательность (<span style="font-weight:bold; color:green">Series</span>)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#1">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#1b">Далее</a></div>
    </div>
</div>

<p>Последовательность <span style="font-weight:bold; color:green">Series</span> - одномерный массив с метками (индексами) для хранения различных типов данных: целых (integer), действительных чисел (float), строк (string), объектов Python</p>

In [3]:
data  = ['Dima', 'Sveta', 'Alex', 'Ivan', 'Kate', 'Maria']
# index = list(range(1,7))

s = pd.Series(data=data, name='Name')
s

0     Dima
1    Sveta
2     Alex
3     Ivan
4     Kate
5    Maria
Name: Name, dtype: object

In [4]:
data  = [-2.011894, 0.098981, 0.693385, 1.055508, 0.640023]
index = ['a', 'b', 'c', 'd', 'e']

In [5]:
s2 = pd.Series(data=data, index=index, name='Number')
s2

a   -2.011894
b    0.098981
c    0.693385
d    1.055508
e    0.640023
Name: Number, dtype: float64

In [6]:
data  = [-2.0, 0.0, 0.0, 1.0, 0.0]
index = ['a', 'b', 'c', 'd', 'e']

In [7]:
s3 = pd.Series(data=data, index=index, name='Number', dtype='int32')
s3

a   -2
b    0
c    0
d    1
e    0
Name: Number, dtype: int32

Вывод первых (`head`) и последних (`tail`) $n$ значений

In [8]:
s.head(2)

0     Dima
1    Sveta
Name: Name, dtype: object

In [9]:
s.tail(2)

4     Kate
5    Maria
Name: Name, dtype: object

Возврат `numpy` массива

In [10]:
s.to_numpy()

array(['Dima', 'Sveta', 'Alex', 'Ivan', 'Kate', 'Maria'], dtype=object)

<p>Обращение к элементам <span style="font-weight:bold; color:green">Series</span></p>

In [11]:
s

0     Dima
1    Sveta
2     Alex
3     Ivan
4     Kate
5    Maria
Name: Name, dtype: object

In [12]:
s[3]

'Ivan'

In [13]:
s2

a   -2.011894
b    0.098981
c    0.693385
d    1.055508
e    0.640023
Name: Number, dtype: float64

In [14]:
s2['b'], s2[1], s2.iloc[1], s2.loc['b']

(0.098981, 0.098981, 0.098981, 0.098981)

In [15]:
s[3] = "NewAlex"
s

0       Dima
1      Sveta
2       Alex
3    NewAlex
4       Kate
5      Maria
Name: Name, dtype: object

<a name="1b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Табличная структура данных (<span style="font-weight:bold; color:green">DataFrame</span>)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#1a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#1c">Далее</a></div>
    </div>
</div>

<p>Табличная структура <span style="font-weight:bold; color:green">DataFrame</span> - двумерный массив с метками</p>

In [16]:
rand_matrix = np.random.randn(4,3)
rand_matrix

array([[-0.11104408, -0.97475588, -1.50321846],
       [-0.13507489, -1.4188861 ,  1.15624258],
       [-0.1457026 , -0.19530907, -0.23337707],
       [ 1.86715893,  0.29593247, -1.04385187]])

In [17]:
cmls = ['Column_1', 'Column_2', 'Column_3']
cmls

['Column_1', 'Column_2', 'Column_3']

In [18]:
df = pd.DataFrame(data=rand_matrix, columns=cmls)
df

   Column_1  Column_2  Column_3
0 -0.111044 -0.974756 -1.503218
1 -0.135075 -1.418886  1.156243
2 -0.145703 -0.195309 -0.233377
3  1.867159  0.295932 -1.043852

In [19]:
df2 = pd.DataFrame(data=rand_matrix, columns=cmls, index=['a','b','c','d'])
df2

   Column_1  Column_2  Column_3
a -0.111044 -0.974756 -1.503218
b -0.135075 -1.418886  1.156243
c -0.145703 -0.195309 -0.233377
d  1.867159  0.295932 -1.043852

<p>Вывод первых и последних $n$ значений</p>

In [20]:
df2.head(2)

   Column_1  Column_2  Column_3
a -0.111044 -0.974756 -1.503218
b -0.135075 -1.418886  1.156243

In [21]:
df2.tail(2)

   Column_1  Column_2  Column_3
c -0.145703 -0.195309 -0.233377
d  1.867159  0.295932 -1.043852

Возврат `numpy` массива

In [22]:
df.to_numpy()

array([[-0.11104408, -0.97475588, -1.50321846],
       [-0.13507489, -1.4188861 ,  1.15624258],
       [-0.1457026 , -0.19530907, -0.23337707],
       [ 1.86715893,  0.29593247, -1.04385187]])

<p>Способы обращения к столбцам, строкам и ячейкам <span style="font-weight:bold; color:green">DataFrame</span>'а рассматриваются в следующих разделах</p>

<a name="2"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">2. Первые шаги с <span style="font-weight:bold; color:green">DataFrame</span></div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

Рассматриваемые вопросы:

a) создание `DataFrame`'а: с использованием матрицы, списков, словаря, последовательностей <br>
b) обращение к элементам <br>
c) запись содержания `DataFrame`'а во внешний файл: `csv` формат данных <br>
d) загрузка внешних данных в `DataFrame`: обращение к ячейкам, изменение значений

<a name="2a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Создание <span style="font-weight:bold; color:green">DataFrame</span>'а</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2b">Далее</a></div>
    </div>
</div>

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>матрицы</i></p>

In [23]:
matrix = [
    ['Dima', 'Moscow', 1988, 4, 'm'],
    ['Sveta', 'Kiev', 1999, 4, 'f'],
    ['Alex', 'Minsk', 1954, np.NaN, 'm'],
    ['Ivan', 'St.Petersburg', 2005, 6, 'm'],
    ['Kate', 'London', 2001, np.NaN, 'f'],
    ['Maria', 'New York', 1997, 7, 'f']
]

matrix

[['Dima', 'Moscow', 1988, 4, 'm'],
 ['Sveta', 'Kiev', 1999, 4, 'f'],
 ['Alex', 'Minsk', 1954, nan, 'm'],
 ['Ivan', 'St.Petersburg', 2005, 6, 'm'],
 ['Kate', 'London', 2001, nan, 'f'],
 ['Maria', 'New York', 1997, 7, 'f']]

In [24]:
columns = ['Name', 'City', 'Year', 'Grade', 'Gender']

df = pd.DataFrame(data=matrix, columns=columns)
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   City    6 non-null      object
 2   Year    6 non-null      int64
 3   Grade   4 non-null      float64
 4   Gender  6 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 372.0+ bytes

In [26]:
def init_df():
    return pd.DataFrame(data=matrix, columns=columns)

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>списков</i> и <b>zip()</b></p>

In [27]:
names = ["Dima", "Sveta","Alex", "Ivan", "Kate", "Maria"]
cities = ["Moscow", "Kiev", "Minsk", "St.Petersburg", "London", "New York"]
year = [1988, 1999, 1954, 2005, 2001, 1997]
grades = [4, 4, np.NaN, 6, np.NaN, 7]
gender = ["m", "f", "m", "m", "f", "f"]

rows = list(zip(names, cities, year, grades, gender))
rows

[('Dima', 'Moscow', 1988, 4, 'm'),
 ('Sveta', 'Kiev', 1999, 4, 'f'),
 ('Alex', 'Minsk', 1954, nan, 'm'),
 ('Ivan', 'St.Petersburg', 2005, 6, 'm'),
 ('Kate', 'London', 2001, nan, 'f'),
 ('Maria', 'New York', 1997, 7, 'f')]

In [28]:
df = pd.DataFrame(data=rows, columns=['Name', 'City', 'Year', 'Grade', 'Gender'])
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>списков</i> и <i>словаря</i></p>

In [29]:
d_data = {
    'Name': ["Dima", "Sveta","Alex", "Ivan", "Kate", "Maria"],
    'City': ["Moscow", "Kiev", "Minsk", "St.Petersburg", "London", "New York"],
    'Year': [1988, 1999, 1954, 2005, 2001, 1997],
    'Grade': [4, 4, np.NaN, 6, np.NaN, 7],
    'Gender': ["m", "f", "m", "m", "f", "f"]
}
d_data

{'Name': ['Dima', 'Sveta', 'Alex', 'Ivan', 'Kate', 'Maria'],
 'City': ['Moscow', 'Kiev', 'Minsk', 'St.Petersburg', 'London', 'New York'],
 'Year': [1988, 1999, 1954, 2005, 2001, 1997],
 'Grade': [4, 4, nan, 6, nan, 7],
 'Gender': ['m', 'f', 'm', 'm', 'f', 'f']}

In [30]:
df = pd.DataFrame(data=d_data)
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

<p>Чтобы указать последовательность столбцов, следует воспользоваться параметром <i>columns</i></p>

In [31]:
df = pd.DataFrame(data=d_data, columns=['Name', 'Year', 'City', 'Grade', 'Gender'])
df

    Name  Year           City  Grade Gender
0   Dima  1988         Moscow    4.0      m
1  Sveta  1999           Kiev    4.0      f
2   Alex  1954          Minsk    NaN      m
3   Ivan  2005  St.Petersburg    6.0      m
4   Kate  2001         London    NaN      f
5  Maria  1997       New York    7.0      f

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>последовательностей</i></p>

In [32]:
s1 = pd.Series(data=["Dima", "Sveta", "Alex", "Ivan", "Kate", "Maria"], name="Name")
s2 = pd.Series(data=["Moscow", "Kiev", "Minsk", "St.Petersburg", "London", "New York"], name="City")
s3 = pd.Series(data=[1988, 1999, 1954, 2005, 2001, 1997], name="Year")
s4 = pd.Series(data=[4, 4, np.NaN, 6, np.NaN, 7], name="Grade")
s5 = pd.Series(data=['m', 'f', 'm', 'm', 'f', 'f'], name="Gender")

df1 = pd.DataFrame(data=[s1,s2,s3,s4,s5])
df1

             0      1      2              3       4         5
Name      Dima  Sveta   Alex           Ivan    Kate     Maria
City    Moscow   Kiev  Minsk  St.Petersburg  London  New York
Year      1988   1999   1954           2005    2001      1997
Grade      4.0    4.0    NaN            6.0     NaN       7.0
Gender       m      f      m              m       f         f

In [33]:
df1 = df1.T
df1

    Name           City  Year Grade Gender
0   Dima         Moscow  1988   4.0      m
1  Sveta           Kiev  1999   4.0      f
2   Alex          Minsk  1954   NaN      m
3   Ivan  St.Petersburg  2005   6.0      m
4   Kate         London  2001   NaN      f
5  Maria       New York  1997   7.0      f

In [34]:
df2 = pd.DataFrame({"Name": s1.values, "City": s2.values, "Year": s3.values})
df2

    Name           City  Year
0   Dima         Moscow  1988
1  Sveta           Kiev  1999
2   Alex          Minsk  1954
3   Ivan  St.Petersburg  2005
4   Kate         London  2001
5  Maria       New York  1997

Чтобы изменить стандартную индексацию от 0, можно воспользоваться следующим выражением

In [35]:
df.index = df.index + 1  # индексация будет от 1
df

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m
5   Kate  2001         London    NaN      f
6  Maria  1997       New York    7.0      f

<p>Доступ к индексам</p>

In [36]:
df.index

RangeIndex(start=1, stop=7, step=1)

<p>Доступ к именам столбцов</p>

In [37]:
df.columns

Index(['Name', 'Year', 'City', 'Grade', 'Gender'], dtype='object')

<a name="2b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Обращение к элементам <span style="font-weight:bold; color:green">DataFrame</span></div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2c">Далее</a></div>
    </div>
</div>

Обращение к элементу по **индексу** строки и имени столбца

In [38]:
df

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m
5   Kate  2001         London    NaN      f
6  Maria  1997       New York    7.0      f

In [39]:
df.loc[2, 'City']

'Kiev'

Обращение к элементу по **номеру** строки и номеру столбца

In [40]:
df.iloc[2, 2]

'Minsk'

<a name="2c"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">c. Запись содержания <span style="font-weight:bold; color:green">DataFrame</span> во внешний файл</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2b">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2d">Далее</a></div>
    </div>
</div>

Pandas позволяет работать с различными форматами файлов, такими как `csv`, `excel`, `xml`, `json` и др. Более подробно [здесь](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html). <br>
В качестве примера далее рассматривается небольшой пример того, как значения `DataFrame`'а записать во внешний файл csv, а затем загрузить из него данные обратно в `DataFrame`

Запись данных в файл `csv`

In [41]:
df.to_csv("testFile.csv", index=False, header=True)

<a name="2d"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">d. Загрузка внешних данных в <span style="font-weight:bold; color:green">DataFrame</span></div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2c">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3">Далее</a></div>
    </div>
</div>

In [42]:
df1 = pd.read_csv("testFile.csv")
df1

    Name  Year           City  Grade Gender
0   Dima  1988         Moscow    4.0      m
1  Sveta  1999           Kiev    4.0      f
2   Alex  1954          Minsk    NaN      m
3   Ivan  2005  St.Petersburg    6.0      m
4   Kate  2001         London    NaN      f
5  Maria  1997       New York    7.0      f

<a name="3"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-size:14pt; font-weight:bold">3. Манипулирование <span style="font-weight:bold; color:green">DataFrame</span>'ми</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
</div>

<div style="padding-bottom:10px; border-bottom:1px solid lightgrey"></div>

<div>
    
Рассматриваемые вопросы: <br>

a) работа со столбцами: *выбор данных по столбцам, добавление/удаление столбца* <br>
b) работа со строками: *выбор строк по индексу, использование условий, добавление/удаление строк* <br>
c) работа с ячейками: *обращение к ячейкам, изменение значений* <br>
d) использованием метода `groupby` для группировки <br>
e) сортировка строк <br>
f) формирование сложных индексов <br>
g) объединение нескольких `DataFrame`'ов: `append`, `concat`, `merge`, `join` <br>
h) методы `iterrows`, `map`, `apply`, `applymap`

</div>

<a name="3a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Столбцы</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3b">Далее</a></div>
    </div>
</div>

<p>Исходный <span style="font-weight:bold; color:green">DataFrame</span></p>

In [43]:
df

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m
5   Kate  2001         London    NaN      f
6  Maria  1997       New York    7.0      f

#### Выбор столбцов

<p>Получение последовательности по имени столбца</p>

In [44]:
s_name = df['Name']
s_name

1     Dima
2    Sveta
3     Alex
4     Ivan
5     Kate
6    Maria
Name: Name, dtype: object

In [45]:
s_name = df.Name
s_name

1     Dima
2    Sveta
3     Alex
4     Ivan
5     Kate
6    Maria
Name: Name, dtype: object

In [46]:
type(s_name)

pandas.core.series.Series

<p>Получение DataFrame по столбцу</p>

In [47]:
df_name = df[['Name']]  # обращение по имени столбца
df_name

    Name
1   Dima
2  Sveta
3   Alex
4   Ivan
5   Kate
6  Maria

In [48]:
df_name = df[[df.columns[0]]]  # обращение по индексу столбца
df_name

    Name
1   Dima
2  Sveta
3   Alex
4   Ivan
5   Kate
6  Maria

In [49]:
type(df_name)

pandas.core.frame.DataFrame

<p>Использование нескольких столбцов для выбора данных</p>

In [50]:
df_select = df[['Name', 'City']]
df_select

    Name           City
1   Dima         Moscow
2  Sveta           Kiev
3   Alex          Minsk
4   Ivan  St.Petersburg
5   Kate         London
6  Maria       New York

Метод `filter`

In [51]:
df.filter(items=['Name', 'City'], axis=1)

    Name           City
1   Dima         Moscow
2  Sveta           Kiev
3   Alex          Minsk
4   Ivan  St.Petersburg
5   Kate         London
6  Maria       New York

In [52]:
df.filter(like='i', axis=1)

            City
1         Moscow
2           Kiev
3          Minsk
4  St.Petersburg
5         London
6       New York

In [53]:
df.filter(regex='i', axis=1)

            City
1         Moscow
2           Kiev
3          Minsk
4  St.Petersburg
5         London
6       New York

Получение уникальных значений столбца

In [54]:
df.Name.unique()

array(['Dima', 'Sveta', 'Alex', 'Ivan', 'Kate', 'Maria'], dtype=object)

In [55]:
df['Gender'].unique()

array(['m', 'f'], dtype=object)

#### Добавление/изменение столбца

In [56]:
df['NewColumn'] = [4, 5, 7, 3, 2, 6]  # добавление
df

    Name  Year           City  Grade Gender  NewColumn
1   Dima  1988         Moscow    4.0      m          4
2  Sveta  1999           Kiev    4.0      f          5
3   Alex  1954          Minsk    NaN      m          7
4   Ivan  2005  St.Petersburg    6.0      m          3
5   Kate  2001         London    NaN      f          2
6  Maria  1997       New York    7.0      f          6

In [57]:
df['Grade'] = [1, 1, 1, 1, 1, 1]  # изменение
df

    Name  Year           City  Grade Gender  NewColumn
1   Dima  1988         Moscow      1      m          4
2  Sveta  1999           Kiev      1      f          5
3   Alex  1954          Minsk      1      m          7
4   Ivan  2005  St.Petersburg      1      m          3
5   Kate  2001         London      1      f          2
6  Maria  1997       New York      1      f          6

In [58]:
df['Grade'] = [4, 4, np.NaN, 6, np.NaN, 7]
df

    Name  Year           City  Grade Gender  NewColumn
1   Dima  1988         Moscow    4.0      m          4
2  Sveta  1999           Kiev    4.0      f          5
3   Alex  1954          Minsk    NaN      m          7
4   Ivan  2005  St.Petersburg    6.0      m          3
5   Kate  2001         London    NaN      f          2
6  Maria  1997       New York    7.0      f          6

In [59]:
if 'NewColumn2' not in df.columns:
    df.insert(loc=1, value=[10,40,50,30,70,49], column='NewColumn2')  # loc - позиция столбца
df

    Name  NewColumn2  Year           City  Grade Gender  NewColumn
1   Dima          10  1988         Moscow    4.0      m          4
2  Sveta          40  1999           Kiev    4.0      f          5
3   Alex          50  1954          Minsk    NaN      m          7
4   Ivan          30  2005  St.Petersburg    6.0      m          3
5   Kate          70  2001         London    NaN      f          2
6  Maria          49  1997       New York    7.0      f          6

Создание из исходного `df` нового `DataFrame`'а `df2` без столбца `NewColumn` </p>

In [60]:
df2 = df.drop('NewColumn', axis=1, inplace=False)  # axis = 1 - удаление столбца
df2

    Name  NewColumn2  Year           City  Grade Gender
1   Dima          10  1988         Moscow    4.0      m
2  Sveta          40  1999           Kiev    4.0      f
3   Alex          50  1954          Minsk    NaN      m
4   Ivan          30  2005  St.Petersburg    6.0      m
5   Kate          70  2001         London    NaN      f
6  Maria          49  1997       New York    7.0      f

In [61]:
df

    Name  NewColumn2  Year           City  Grade Gender  NewColumn
1   Dima          10  1988         Moscow    4.0      m          4
2  Sveta          40  1999           Kiev    4.0      f          5
3   Alex          50  1954          Minsk    NaN      m          7
4   Ivan          30  2005  St.Petersburg    6.0      m          3
5   Kate          70  2001         London    NaN      f          2
6  Maria          49  1997       New York    7.0      f          6

Удаление столбцов из исходного `DataFrame`'а

In [62]:
df.drop(['NewColumn', 'NewColumn2'], axis=1, inplace=True)  # удаление нескольких столбцов
df

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m
5   Kate  2001         London    NaN      f
6  Maria  1997       New York    7.0      f

<a name="3b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Строки</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3c">Далее</a></div>
    </div>
</div>

Исходный `DataFrame`

In [63]:
df

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m
5   Kate  2001         London    NaN      f
6  Maria  1997       New York    7.0      f

#### Фильтрация строк

<p>Выбор строк по <b>индексу</b></p>

In [64]:
df.loc[2]

Name      Sveta
Year       1999
City       Kiev
Grade       4.0
Gender        f
Name: 2, dtype: object

<p>Выбор строк по <b>позиции</b> (номер строки начиная с 0)</p>

In [65]:
df.iloc[2]

Name       Alex
Year       1954
City      Minsk
Grade       NaN
Gender        m
Name: 3, dtype: object

Использование диапазона позиций

In [66]:
df[:3]

    Name  Year    City  Grade Gender
1   Dima  1988  Moscow    4.0      m
2  Sveta  1999    Kiev    4.0      f
3   Alex  1954   Minsk    NaN      m

In [67]:
df[1:4]

    Name  Year           City  Grade Gender
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m

<p>Использование условий</p>

In [68]:
df[df['Name']=='Dima']

   Name  Year    City  Grade Gender
1  Dima  1988  Moscow    4.0      m

In [69]:
df[df['Grade']>=5]

    Name  Year           City  Grade Gender
4   Ivan  2005  St.Petersburg    6.0      m
6  Maria  1997       New York    7.0      f

In [70]:
df[df.Grade>=5]

    Name  Year           City  Grade Gender
4   Ivan  2005  St.Petersburg    6.0      m
6  Maria  1997       New York    7.0      f

In [71]:
df[(df.Grade>=5) & (df.Gender=='f')]  # операция "И"

    Name  Year      City  Grade Gender
6  Maria  1997  New York    7.0      f

In [72]:
df[(df.Grade==4) | (df.Grade==6)]  # операция "ИЛИ"

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m

In [73]:
cond = (df.Grade==4) | (df.Grade==6)

In [74]:
cond

1     True
2     True
3    False
4     True
5    False
6    False
Name: Grade, dtype: bool

In [75]:
df[cond]

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m

Применение метода `isin` для вывода строк, в которых значение заданного столбца содержится в списке

In [76]:
#df.City.isin(l_cities)

In [77]:
l_cities = ['Moscow', 'Minsk']
df2 = df[df.City.isin(l_cities)]
df2

   Name  Year    City  Grade Gender
1  Dima  1988  Moscow    4.0      m
3  Alex  1954   Minsk    NaN      m

Функция `isnan`

In [78]:
df[pd.isna(df.Grade)]  # строки с неопредленным значнием Grade

   Name  Year    City  Grade Gender
3  Alex  1954   Minsk    NaN      m
5  Kate  2001  London    NaN      f

Функция `notna`

In [79]:
df[pd.notna(df.Grade)]  # notnull

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m
6  Maria  1997       New York    7.0      f

#### Метод `filter`

In [80]:
cond = (df.Grade==4) | (df.Grade==6)
indx = df.index[cond]

df.filter(items=indx, axis=0)

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m

#### Метод `query`

In [81]:
# тоже с методом query
df.query('Grade == 4 | Grade == 6')

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m

In [82]:
a = 4
df.query(f'Grade == {a} | Grade == 6')

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m

In [83]:
grade_list = [4, 6]
df.query('Grade == @grade_list')

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
4   Ivan  2005  St.Petersburg    6.0      m

In [84]:
df.query('Grade + 5 > 10')

    Name  Year           City  Grade Gender
4   Ivan  2005  St.Petersburg    6.0      m
6  Maria  1997       New York    7.0      f

#### Добавление/изменение строки

In [85]:
df

    Name  Year           City  Grade Gender
1   Dima  1988         Moscow    4.0      m
2  Sveta  1999           Kiev    4.0      f
3   Alex  1954          Minsk    NaN      m
4   Ivan  2005  St.Petersburg    6.0      m
5   Kate  2001         London    NaN      f
6  Maria  1997       New York    7.0      f

In [86]:
# Добавление строки с указанием индекса
df.loc[10] = ['NewName', 'NewCity', 2016, 1, 'f']
df

       Name     Year           City  Grade Gender
1      Dima     1988         Moscow    4.0      m
2     Sveta     1999           Kiev    4.0      f
3      Alex     1954          Minsk    NaN      m
4      Ivan     2005  St.Petersburg    6.0      m
5      Kate     2001         London    NaN      f
6     Maria     1997       New York    7.0      f
10  NewName  NewCity           2016    1.0      f

In [87]:
# Изменение строки с указанием её номера
df.loc[4] = ['ChangedIvan', 'St.Petersburg', 2005, 6, 'm']
df

           Name           Year      City  Grade Gender
1          Dima           1988    Moscow    4.0      m
2         Sveta           1999      Kiev    4.0      f
3          Alex           1954     Minsk    NaN      m
4   ChangedIvan  St.Petersburg      2005    6.0      m
5          Kate           2001    London    NaN      f
6         Maria           1997  New York    7.0      f
10      NewName        NewCity      2016    1.0      f

In [88]:
# Изменение строки по индексу строки
df.iloc[0] = ['Changed', 'Changed', 2000, 10, 'm']
df

           Name           Year      City  Grade Gender
1       Changed        Changed      2000   10.0      m
2         Sveta           1999      Kiev    4.0      f
3          Alex           1954     Minsk    NaN      m
4   ChangedIvan  St.Petersburg      2005    6.0      m
5          Kate           2001    London    NaN      f
6         Maria           1997  New York    7.0      f
10      NewName        NewCity      2016    1.0      f

Метод `fillna` заполняет пустые ячейки значением аргумента

In [89]:
df4 = df['Grade'].fillna(-1)  # возвращает новый DataFrame
pd.DataFrame(df4)

    Grade
1    10.0
2     4.0
3    -1.0
4     6.0
5    -1.0
6     7.0
10    1.0

<p>Удаление строки</p>

In [90]:
# Удаление по номеру строки, axis = 0 - строки, inplace = True - удаляет в df
df.drop(df.index[6], axis=0, inplace=True)
df

          Name           Year      City  Grade Gender
1      Changed        Changed      2000   10.0      m
2        Sveta           1999      Kiev    4.0      f
3         Alex           1954     Minsk    NaN      m
4  ChangedIvan  St.Petersburg      2005    6.0      m
5         Kate           2001    London    NaN      f
6        Maria           1997  New York    7.0      f

In [91]:
# Удаление по индексу строки
df.drop(df.index[df.index==1], axis=0, inplace=True)
df

          Name           Year      City  Grade Gender
2        Sveta           1999      Kiev    4.0      f
3         Alex           1954     Minsk    NaN      m
4  ChangedIvan  St.Petersburg      2005    6.0      m
5         Kate           2001    London    NaN      f
6        Maria           1997  New York    7.0      f

In [92]:
df2 = df.drop(df.index[df.index==2], axis=0, inplace=False)
df2

          Name           Year      City  Grade Gender
3         Alex           1954     Minsk    NaN      m
4  ChangedIvan  St.Petersburg      2005    6.0      m
5         Kate           2001    London    NaN      f
6        Maria           1997  New York    7.0      f

In [93]:
df

          Name           Year      City  Grade Gender
2        Sveta           1999      Kiev    4.0      f
3         Alex           1954     Minsk    NaN      m
4  ChangedIvan  St.Petersburg      2005    6.0      m
5         Kate           2001    London    NaN      f
6        Maria           1997  New York    7.0      f

Удаление всех строк, в которых есть неопределенное значение (`NaN`)

In [94]:
df.dropna()  # возвращает новый DataFrame

          Name           Year      City  Grade Gender
2        Sveta           1999      Kiev    4.0      f
4  ChangedIvan  St.Petersburg      2005    6.0      m
6        Maria           1997  New York    7.0      f

<a name="3c"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">c. Значения ячеек</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3b">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3d">Далее</a></div>
    </div>
</div>

<p>Обращение по <b>индексу</b> строки</p>

In [95]:
df.loc[2, 'City']

'Kiev'

<p>Обращение по <b>позиции</b> (номеру) строки</p>

In [96]:
df.iloc[2, 1]

'St.Petersburg'

Пример использования с циклом `for`

In [97]:
# Изменение значений в столбце Grade на +10
# Замечение: есть более простой способ для такой операции (см. раздел 4)
for i in range(len(df)):
    df.iloc[i, 3] += 10
df

          Name           Year      City  Grade Gender
2        Sveta           1999      Kiev   14.0      f
3         Alex           1954     Minsk    NaN      m
4  ChangedIvan  St.Petersburg      2005   16.0      m
5         Kate           2001    London    NaN      f
6        Maria           1997  New York   17.0      f

<p>Срезы по строкам</p>

In [98]:
df.loc[:, 'City']

2        Kiev
3       Minsk
4        2005
5      London
6    New York
Name: City, dtype: object

In [99]:
df.iloc[:, 2]

2        Kiev
3       Minsk
4        2005
5      London
6    New York
Name: City, dtype: object

<p>Срезы по строкам и столбцам</p>

In [100]:
df.loc[1:4, 'Name':'City']

          Name           Year   City
2        Sveta           1999   Kiev
3         Alex           1954  Minsk
4  ChangedIvan  St.Petersburg   2005

In [101]:
df

          Name           Year      City  Grade Gender
2        Sveta           1999      Kiev   14.0      f
3         Alex           1954     Minsk    NaN      m
4  ChangedIvan  St.Petersburg      2005   16.0      m
5         Kate           2001    London    NaN      f
6        Maria           1997  New York   17.0      f

Изменение значения ячейки. Если нет указанного индекса в `DataFrame`'е, то добавляется новая строка

In [102]:
df.loc[11, 'Name'] = 'NewName'
df

           Name           Year      City  Grade Gender
2         Sveta           1999      Kiev   14.0      f
3          Alex           1954     Minsk    NaN      m
4   ChangedIvan  St.Petersburg      2005   16.0      m
5          Kate           2001    London    NaN      f
6         Maria           1997  New York   17.0      f
11      NewName            NaN       NaN    NaN    NaN

In [103]:
df.iloc[2, 0] = 'NewName'
df

       Name           Year      City  Grade Gender
2     Sveta           1999      Kiev   14.0      f
3      Alex           1954     Minsk    NaN      m
4   NewName  St.Petersburg      2005   16.0      m
5      Kate           2001    London    NaN      f
6     Maria           1997  New York   17.0      f
11  NewName            NaN       NaN    NaN    NaN

In [104]:
df.drop(df.index[df.index==11], axis=0, inplace=True) # удаление по индексу строки
df

      Name           Year      City  Grade Gender
2    Sveta           1999      Kiev   14.0      f
3     Alex           1954     Minsk    NaN      m
4  NewName  St.Petersburg      2005   16.0      m
5     Kate           2001    London    NaN      f
6    Maria           1997  New York   17.0      f

<a name="3d"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">d. Группировка</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3c">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3e">Далее</a></div>
    </div>
</div>

In [105]:
# исходный датафрейм
df = init_df()
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [106]:
# дополнительные столбцы
salary = [10, 40, 50, 30, 70, 49]
marital_status = [True, False, True, True, True, False]

# создание нового датафрейма со столбцами salary и marital_status
df_group = df.copy()
df_group['Salary'] = salary
df_group['Marriage'] = marital_status
df_group

    Name           City  Year  Grade Gender  Salary  Marriage
0   Dima         Moscow  1988    4.0      m      10      True
1  Sveta           Kiev  1999    4.0      f      40     False
2   Alex          Minsk  1954    NaN      m      50      True
3   Ivan  St.Petersburg  2005    6.0      m      30      True
4   Kate         London  2001    NaN      f      70      True
5  Maria       New York  1997    7.0      f      49     False

In [151]:
# итеративный объект с группами по значению столбца
groupby = df_group.groupby('Gender')
groupby

In [152]:
# вывод групп
for i, group in groupby:
    print(i)
    print(group)

f
    Name      City  Year  Grade Gender  Salary  Marriage Salary_Interval
1  Sveta      Kiev  1999    4.0      f      40     False          medium
4   Kate    London  2001    NaN      f      70      True            good
5  Maria  New York  1997    7.0      f      49     False          medium
m
   Name           City  Year  Grade Gender  Salary  Marriage Salary_Interval
0  Dima         Moscow  1988    4.0      m      10      True             bad
2  Alex          Minsk  1954    NaN      m      50      True          medium
3  Ivan  St.Petersburg  2005    6.0      m      30      True             bad

In [109]:
# количество строк в каждой группе
groupby.size()

Gender
f    3
m    3
dtype: int64

In [110]:
# группировка по нескольким столбцам
groupby_2 = df_group.groupby(['Gender', 'Marriage'])

# вывод
for i, group in groupby_2:
    print(i)
    print(group)

('f', False)
    Name      City  Year  Grade Gender  Salary  Marriage
1  Sveta      Kiev  1999    4.0      f      40     False
5  Maria  New York  1997    7.0      f      49     False
('f', True)
   Name    City  Year  Grade Gender  Salary  Marriage
4  Kate  London  2001    NaN      f      70      True
('m', True)
   Name           City  Year  Grade Gender  Salary  Marriage
0  Dima         Moscow  1988    4.0      m      10      True
2  Alex          Minsk  1954    NaN      m      50      True
3  Ivan  St.Petersburg  2005    6.0      m      30      True

In [111]:
# доступ к конкретной группе 
df2 = groupby.get_group('f')
df2

    Name      City  Year  Grade Gender  Salary  Marriage
1  Sveta      Kiev  1999    4.0      f      40     False
4   Kate    London  2001    NaN      f      70      True
5  Maria  New York  1997    7.0      f      49     False

In [112]:
groupby_2.get_group(('f', False))

    Name      City  Year  Grade Gender  Salary  Marriage
1  Sveta      Kiev  1999    4.0      f      40     False
5  Maria  New York  1997    7.0      f      49     False

<p>Фильтр для групп</p>

In [113]:
# исходный датафрейм
df_group

    Name           City  Year  Grade Gender  Salary  Marriage
0   Dima         Moscow  1988    4.0      m      10      True
1  Sveta           Kiev  1999    4.0      f      40     False
2   Alex          Minsk  1954    NaN      m      50      True
3   Ivan  St.Petersburg  2005    6.0      m      30      True
4   Kate         London  2001    NaN      f      70      True
5  Maria       New York  1997    7.0      f      49     False

In [114]:
# Возвращает DataFrame с группами, в которых сумма Grade > 10
df_group\
    .groupby('Gender')\
    .filter(lambda group: group.Grade.sum() > 10)

    Name      City  Year  Grade Gender  Salary  Marriage
1  Sveta      Kiev  1999    4.0      f      40     False
4   Kate    London  2001    NaN      f      70      True
5  Maria  New York  1997    7.0      f      49     False

<p>Агрегирование в группах</p>

In [115]:
# исходный датафрейм
df2 = df_group[['Gender', 'Grade', 'Salary']]
df2

  Gender  Grade  Salary
0      m    4.0      10
1      f    4.0      40
2      m    NaN      50
3      m    6.0      30
4      f    NaN      70
5      f    7.0      49

In [116]:
# использование aggregate c udf функцией
df2\
    .groupby('Gender')\
    .aggregate(lambda group: group.mean())  # .agg - сокращение

        Grade  Salary
Gender
f         5.5    53.0
m         5.0    30.0

In [117]:
# использование aggregate cо стандартной функцией
df2\
    .groupby('Gender')\
    .agg('sum')

        Grade  Salary
Gender
f        11.0     159
m        10.0      90

In [118]:
# использование sum для групп
df2\
    .groupby('Gender')\
    .sum()

        Grade  Salary
Gender
f        11.0     159
m        10.0      90

In [119]:
# если нужены только определенные столбцы
df2\
    .groupby('Gender')[['Salary']]\
    .sum()

        Salary
Gender
f          159
m           90

In [120]:
# TODO: "Salary": "sum", "Grade": "min"
df2\
    .groupby('Gender')\
    .agg({'Salary': 'sum', 'Grade': ['min', 'max']})

       Salary Grade
          sum   min  max
Gender
f         159   4.0  7.0
m          90   4.0  6.0

<p>Трансформация выполняется для элементов отдельных столбцов каждой группы</p>

In [121]:
# пример операции над массивами (вычитание среднего)
# v = np.array([1,2,3])
# v - v.mean()

In [122]:
# исходный датафрейм
df2

  Gender  Grade  Salary
0      m    4.0      10
1      f    4.0      40
2      m    NaN      50
3      m    6.0      30
4      f    NaN      70
5      f    7.0      49

In [123]:
# средние каждой группы
df2\
    .groupby('Gender')\
    .mean()

        Grade  Salary
Gender
f         5.5    53.0
m         5.0    30.0

In [124]:
# Значение элемента минус среднее значение в столбце группы
# [1,2,3]-2 = [-1,0,1]
df2\
    .groupby('Gender')\
    .transform(lambda x: x - x.mean())

   Grade  Salary
0   -1.0   -20.0
1   -1.5   -13.0
2    NaN    20.0
3    1.0     0.0
4    NaN    17.0
5    1.5    -4.0

In [125]:
df2\
    .groupby('Gender')\
    .apply(lambda x: x - x.mean())

          Grade  Salary
Gender
f      1   -1.5   -13.0
       4    NaN    17.0
       5    1.5    -4.0
m      0   -1.0   -20.0
       2    NaN    20.0
       3    1.0     0.0

<p>Группировка данных по диапазонам значений</p>

In [126]:
df_group['Salary']

0    10
1    40
2    50
3    30
4    70
5    49
Name: Salary, dtype: int64

In [127]:
# Формирование диапазонов
salary_bins = pd.cut(df_group['Salary'], bins=[0, 30, 50, 80])
salary_bins

0     (0, 30]
1    (30, 50]
2    (30, 50]
3     (0, 30]
4    (50, 80]
5    (30, 50]
Name: Salary, dtype: category
Categories (3, interval[int64, right]): [(0, 30] < (30, 50] < (50, 80]]

In [128]:
# Создание одного диапазона
interval = pd.Interval(left=30, right=50, closed='right')
interval

Interval(30, 50, closed='right')

In [129]:
# Группировка по диапазонам
gr3 = df_group.groupby(salary_bins)

# Вывод одной группы
gr3.get_group(interval)

    Name      City  Year  Grade Gender  Salary  Marriage
1  Sveta      Kiev  1999    4.0      f      40     False
2   Alex     Minsk  1954    NaN      m      50      True
5  Maria  New York  1997    7.0      f      49     False

In [130]:
# Формирование именованных диапазонов
salary_bins__named = pd.cut(
    df_group.Salary, 
    bins=[0, 30, 50, 80], 
    labels=['bad', 'medium', 'good']
)
salary_bins__named

0       bad
1    medium
2    medium
3       bad
4      good
5    medium
Name: Salary, dtype: category
Categories (3, object): ['bad' < 'medium' < 'good']

In [131]:
df_group['Salary_Interval'] = salary_bins__named
df_group

    Name           City  Year  Grade Gender  Salary  Marriage Salary_Interval
0   Dima         Moscow  1988    4.0      m      10      True             bad
1  Sveta           Kiev  1999    4.0      f      40     False          medium
2   Alex          Minsk  1954    NaN      m      50      True          medium
3   Ivan  St.Petersburg  2005    6.0      m      30      True             bad
4   Kate         London  2001    NaN      f      70      True            good
5  Maria       New York  1997    7.0      f      49     False          medium

In [132]:
# Группировака и доступ к одной группе
df_group\
    .groupby(salary_bins__named)\
    .get_group('medium')

    Name      City  Year  Grade Gender  Salary  Marriage Salary_Interval
1  Sveta      Kiev  1999    4.0      f      40     False          medium
2   Alex     Minsk  1954    NaN      m      50      True          medium
5  Maria  New York  1997    7.0      f      49     False          medium

In [133]:
# Формирование диапазонов с использованием range
salary_bins__range = pd.cut(x=df_group.Salary, bins=np.arange(0, 100, 10))
salary_bins__range

0     (0, 10]
1    (30, 40]
2    (40, 50]
3    (20, 30]
4    (60, 70]
5    (40, 50]
Name: Salary, dtype: category
Categories (9, interval[int64, right]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] ... (50, 60] < (60, 70] < (70, 80] < (80, 90]]

In [134]:
# Формирование диапазонов с указанием количества диапазонов
salary_bins__num = pd.cut(
    x=df_group.Salary, 
    bins=3, 
    labels=['bad','medium','good']
)
salary_bins__num

0       bad
1    medium
2    medium
3       bad
4      good
5    medium
Name: Salary, dtype: category
Categories (3, object): ['bad' < 'medium' < 'good']

<a name="3e"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">e. Сортировка</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3d">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3f">Далее</a></div>
    </div>
</div>

In [135]:
# исходный массив
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [136]:
# Сортировка по одному столбцу (по возрастанию)
df.sort_values('Year', ascending=1)

    Name           City  Year  Grade Gender
2   Alex          Minsk  1954    NaN      m
0   Dima         Moscow  1988    4.0      m
5  Maria       New York  1997    7.0      f
1  Sveta           Kiev  1999    4.0      f
4   Kate         London  2001    NaN      f
3   Ivan  St.Petersburg  2005    6.0      m

In [137]:
# Сортировка по одному столбцу (по убыванию)
df.sort_values('Year', ascending=0)

    Name           City  Year  Grade Gender
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
1  Sveta           Kiev  1999    4.0      f
5  Maria       New York  1997    7.0      f
0   Dima         Moscow  1988    4.0      m
2   Alex          Minsk  1954    NaN      m

In [138]:
# Сортировка по нескольким столбцам
df.sort_values(['Gender', 'Year'], ascending=[1, 0])

    Name           City  Year  Grade Gender
4   Kate         London  2001    NaN      f
1  Sveta           Kiev  1999    4.0      f
5  Maria       New York  1997    7.0      f
3   Ivan  St.Petersburg  2005    6.0      m
0   Dima         Moscow  1988    4.0      m
2   Alex          Minsk  1954    NaN      m

<a name="3f"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">f. Сложные индексы</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3e">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3g">Далее</a></div>
    </div>
</div>

In [139]:
# Исходные данные
data =  np.random.randint(low=0, high=101, size=(4,3))
data

array([[58, 99, 68],
       [74, 42, 69],
       [ 9, 58, 56],
       [60, 73,  0]])

In [140]:
index1 = ['Week1', 'Week1', 'Week2', 'Week2']  # первый индекс
index2 = ['Working Days', 'Weekend', 'Working Days', 'Weekend']  # второй индекс

# Формирование датафрейма с двумя индексами
df = pd.DataFrame(
    data=data, 
    columns=['TV', 'Smartphone', 'Pendrive'], 
    index=[index1, index2])
df

                    TV  Smartphone  Pendrive
Week1 Working Days  58          99        68
      Weekend       74          42        69
Week2 Working Days   9          58        56
      Weekend       60          73         0

<p>Доступ к данный по индексам</p>

In [141]:
# Вывод данных по первому индексу
df.loc['Week1']

              TV  Smartphone  Pendrive
Working Days  58          99        68
Weekend       74          42        69

In [142]:
# Вывод данных по двум индексам
df.loc[('Week1', 'Weekend')]

TV            74
Smartphone    42
Pendrive      69
Name: (Week1, Weekend), dtype: int32

<p>Пример с суммой</p>

In [143]:
df.sum()  # сумма по столбцам для всех индексов

TV            201
Smartphone    272
Pendrive      193
dtype: int64

In [144]:
df.loc['Week1'].sum()  # сумма по столбцам для Week1

TV            132
Smartphone    141
Pendrive      137
dtype: int64

In [145]:
# Сумма по столбцам за Weekend для Week1 и Week2
df.loc[[('Week1', 'Weekend'),('Week2', 'Weekend')]].sum()

TV            134
Smartphone    115
Pendrive       69
dtype: int64

<a name="3g"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">g. Объединение DataFrame'ов</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3f">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3h">Далее</a></div>
    </div>
</div>

#### Метод `append`

In [146]:
# Загрузка начальной версии df
df = init_df()
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [147]:
# Использование списка словарей
dict_new = [
    {'Name':'Petr', 'City':'Bryansk', 'Year':1990, 'Grade':8}, 
    {'Name':'Ann', 'City':'Tehran'}
]
dict_new

[{'Name': 'Petr', 'City': 'Bryansk', 'Year': 1990, 'Grade': 8},
 {'Name': 'Ann', 'City': 'Tehran'}]

In [148]:
# ignore_index = True - в новом DataFrame будет стандартная индексация от 0.
df2 = df.append(dict_new, ignore_index=True)
df2

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
# Добавление в конец датафрейма
df2.loc[len(df2.index)] = ['Ann', 'Tehran', np.nan, np.nan, np.nan]
df2

In [ ]:
# Использование списка последовательностей
# s1 = pd.Series(
#     data=['Petr', 'Bryansk', 1978, 5, 'm'], 
#     index=['Name', 'City', 'Year', 'Grade', 'Gender']
# )
# s2 = pd.Series(
#     data=['Ann', 'Tehran', 1997, 7, 'f'], 
#     index=['Name', 'City', 'Year', 'Grade', 'Gender']
# )

In [ ]:
# df2 = df.append([s1, s2], ignore_index=True)
# df2

#### Функция `concat`

<p>Добавление строк</p>

In [ ]:
df

In [ ]:
# Создание второго датафрейма
rows_new = [
    ['Petr', 'Bryansk', 1978, 5, 'm'], 
    ['Ann', 'Tehran', 1997, 7, 'f']
]
df2 = pd.DataFrame(
    data=rows_new, 
    columns=['Name','City','Year','Grade','Gender']
)
df2

In [ ]:
# Объединение данных двух датафреймов
df3 = pd.concat([df, df2], ignore_index=False, sort=False)
df3

In [ ]:
# Вывод строк по индексу
df3.loc[1]

In [ ]:
# Объединение данных двух датафреймов
df3 = pd.concat([df, df2], ignore_index=True)
df3

<p>Добавление ключа/индекса</p>

In [ ]:
# Добавление индекса датафрейма
df3 = pd.concat([df, df2], keys=['Table1', 'Table2'])
df3

In [ ]:
# Доступ по первому индексу
df3.loc['Table1']

In [ ]:
# Доступ по двум индексам
df3.loc[('Table1', 1)]

<p>Соединение таблиц по столбцам</p>

In [ ]:
df

In [ ]:
# Создание нового датафрейма
dict_new = {
    'Marriage_status': [True, False, True, False],
    'Salary': [12, 40, 53, 25]
}

df_right_1 = pd.DataFrame(index=[1,3,4,5], data=dict_new)
df_right_1

<p>Внешнее соединение (<b>outer join</b>) таблиц по индексу</p>

In [ ]:
# Соединение двух датафреймов
df3 = pd.concat([df, df_right_1], axis=1, join='outer')
df3

<p>Внутреннее соединение (<b>inner join</b>) таблиц по индексу</p>

In [ ]:
# join = "inner" - соединение по совпадающим индексам строк
df3 = pd.concat([df, df_right_1], axis=1, join='inner')
df3

#### Функция `merge`

<p>Внешнее соединение (<b>outer join</b>) таблиц по индексу</p>

In [ ]:
df3 = pd.merge(
    left=df, right=df_right_1,
    left_index=True, right_index=True, how='outer'
)
df3

<p>Внешнее соединение (<b>outer join</b>) таблиц по значению столбца</p>

In [ ]:
df

In [ ]:
dict_new_2 = {
    'Name': ['Sveta', 'Sveta', 'Alex', 'Alex', 'Kate', 'Vlad', 'Alice'],
    'Device': ['TV', 'Smartphone', 'TV', 'Pendrive', 'TV', 'TV', 'PC']
}

df_right_2 = pd.DataFrame(data=dict_new_2)
df_right_2

In [ ]:
df3 = pd.merge(df, df_right_2, on=['Name'], how='outer')
df3

<p>Внешнее соединение (<b>outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [ ]:
df

In [ ]:
dict_new_3 = {
    "ClientId":[2, 2, 3, 3, 4, 4, 10],
    "Device":["TV", "Smartphone", "TV", "Pendrive", "TV", "TV", "PC"]
}

df_right_3 = pd.DataFrame(data=dict_new_3)
df_right_3

In [ ]:
df3 = pd.merge(df, df_right_3, left_index=True, right_on="ClientId", how="outer")
df3

#### Метод `join`

<p>Внешнее соединение (<b>outer join</b>) таблиц по индексу</p>

In [ ]:
df

In [ ]:
df_right_1

In [ ]:
df3 = df.join(df_right_1, how="outer")
df3

<p>Внешнее соединение (<b>outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [ ]:
dict_new_3 = {
    'ClientId': [2, 2, 3, 3, 4, 4, 10],
    'Device': ['TV', 'Smartphone', 'TV', 'Pendrive', 'TV', 'TV', 'PC']
}

df_left = pd.DataFrame(data=dict_new_3)
df_left

In [ ]:
df3 = df_left.join(other=df, on='ClientId', how='outer')
df3

<p>Левое внешнее соединение (<b>left outer join</b>) таблиц по индексу</p>

In [ ]:
df3 = df.join(df_right_1, how='left')
df3

<p>Внешнее левое соединение (<b>left outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [ ]:
df3 = df_left.join(df, on='ClientId', how='left')
df3

<p>Правое внешнее соединение (<b>right outer join</b>) таблиц по индексу</p>

In [ ]:
df3 = df.join(df_right_1, how='right')
df3

<p>Внешнее правое соединение (<b>right outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [ ]:
df3 = df_left.join(df, on='ClientId', how='right')
df3

<p>Внутреннее соединение (<b>inner join</b>) таблиц по индексу</p>

In [ ]:
df3 = df.join(df_right_1, how='inner')
df3

<p>Внутреннее соединение (<b>inner join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [ ]:
df3 = df_left.join(df, on='ClientId', how='inner')
df3

<a name="3h"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">h. Методы <i>iterrows</i>, <i>map</i>, <i>apply</i>, <i>applymap</i></div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3g">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#4">Далее</a></div>
    </div>
</div>

<p>Использование итератора по строкам - метод <b>iterrows()</b></p>

In [ ]:
for i, row in df.iterrows():
    print(i)
    print(row)

<p>Пример</p>

In [ ]:
df2 = pd.DataFrame(columns=df.columns)  # новый DataFrame со схемой (столбцами) df
for i, row in df.iterrows():
    # Если City есть Moscow или Minsk, строка row добавляется в df2
    if row.City in ['Moscow', 'Minsk']:
        df2.loc[i] = row
        
df2

<p>Выбор/фильтрация строк посредством методов <b>apply()</b> и <b>map()</b></p>

In [ ]:
df2 = df[df["City"].apply(lambda city: city in ["Moscow", "Minsk"])]
df2

In [ ]:
# Через функцию (без lambda)
def func(city):
    return city in ["Moscow", "Minsk"]

df2 = df[df.City.apply(func)]
df2

In [ ]:
# Более простой вариант
df[df.City.isin(["Moscow", "Minsk"])]

<p>Выбор строк без нулевых значений</p>

In [ ]:
df[df.Grade.apply(lambda x: not np.isnan(x))]

In [ ]:
df[df.Grade.notnull()]

<p>Выбор строк с условием Year > 2000</p>

In [ ]:
df[df['Year'].apply(lambda year: year >= 2000)]

In [ ]:
df[df['Year']>=2000]

<p>Применение метода <b>apply()</b> для вычислений</p>

In [ ]:
data = np.random.randint(low=0, high=101, size=(3,7))
data

In [ ]:
dfA = pd.DataFrame(
    data=data, 
    columns=["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"], 
    index = ["TV", "Smartphone", "Pendrive"]
)
dfA

In [ ]:
clmn_sum = dfA.apply(lambda clmns: clmns.sum(), axis=0)  # axis = 0 - выбор по столбцам
clmn_sum

In [ ]:
type(clmn_sum)

In [ ]:
# Более простой вариант
dfA.sum(axis=0)

In [ ]:
# clmn_sum.reset_index()

In [ ]:
clmn_sum.name = 'TotalByDay'
pd.DataFrame(clmn_sum)

In [ ]:
row_sum = dfA.apply(lambda row: row.sum(), axis=1)  # axis = 1 - выбор по строкам
row_sum

In [ ]:
# Более простой вариант
dfA.sum(axis=1)

In [ ]:
row_sum.name = 'TotalByDevice'
pd.DataFrame(row_sum)

In [ ]:
dfA["Working_Days"] = dfA.apply(lambda x: x[:5].sum(), axis=1)
dfA

In [ ]:
# Более простой вариант
dfA.iloc[:,:5].sum(axis=1)

In [ ]:
dfA["Weekend"] = dfA.apply(lambda x: x[5:7].sum(), axis=1)
dfA

In [ ]:
# Более простой вариант
dfA.iloc[:,5:].sum(axis=1)

In [ ]:
# Удаление столбцов Working_Days и Weekend
dfA.drop(["Working_Days","Weekend"], axis=1, inplace=True)

<p>Нормализация значений по строке через <i>apply</i></p>

In [ ]:
dfA.apply(lambda x: x/x.sum(), axis=1)

<p>Нормализация через дополнительную функцию</p>

In [ ]:
def norm(row):
    s = row.sum()
    return [el/s for el in row] # или return row/s

dfA.apply(norm, axis=1)

<p>Применение метода <b>applymap()</b></p>

In [ ]:
dfA

In [ ]:
df4 = dfA.applymap(lambda cell: cell/100)
df4

In [ ]:
# Более простой вариант
dfA / 100

<a name="4"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">4. Математическая поддержка</div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

**Рассматриваемые вопросы:**

a) операции со столбцами:с использованием матрицы, списков, словаря, последовательностей 

b) специалные методы: `count`, `min`, `max`, `sum`, `mean`, `var`, `std`, `describe`, `corr`, `cov`

<a name="4a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Операции со столбцами</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#4">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#4b">Далее</a></div>
    </div>
</div>

In [ ]:
dfA

In [ ]:
nom_values = dfA.Mon / 100
nom_values

In [ ]:
dfA.Mon = dfA.Mon + 10
dfA

In [ ]:
sum_Mon_Tue = dfA["Mon"] + dfA["Tue"]
sum_Mon_Tue

In [ ]:
mult_Mon_Tue = dfA["Mon"] * dfA["Tue"]
mult_Mon_Tue

<p>Пример вычисления суммы по всем столбцам с циклом <i>for</i></p>

In [ ]:
dfA.columns

In [ ]:
dfA["Total"] = dfA[dfA.columns[0]]
for i in range(1, len(dfA.columns)-1):
    dfA["Total"] += dfA[dfA.columns[i]]

dfA

In [ ]:
# Удаление столбца Total
dfA.drop(["Total"], axis=1, inplace=True)
dfA

<p>Пример вычисления суммы по всем столбцам с использованием <i>apply</i></p>

In [ ]:
dfA["Total"] = dfA.apply(lambda row: row.sum(), axis=1)
dfA

In [ ]:
dfA.drop(["Total"], axis=1, inplace=True)

<p>Пример вычисления суммы по всем столбцам с использованием <i>sum</i></p>

In [ ]:
dfA["Total"] = dfA.sum(axis=1)
dfA

In [ ]:
dfA.drop(["Total"], axis=1, inplace=True)

<a name="4b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Специальные методы</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#4a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#5">Далее</a></div>
    </div>
</div>

In [ ]:
dfA

In [ ]:
dfA.count(axis=0)

In [ ]:
dfA.count(axis=1)

In [ ]:
dfA.min(axis=0)

In [ ]:
dfA.min(axis=1)

In [ ]:
dfA["Mon"].min()

In [ ]:
dfA["Mon"].idxmin()

In [ ]:
dfA.max(axis=0)

In [ ]:
dfA.max(axis=1)

In [ ]:
dfA["Mon"].idxmax()

In [ ]:
dfA.sum(axis=0)

In [ ]:
dfA.sum(axis=1)

In [ ]:
dfA["Mon"].sum()

In [ ]:
dfA.mean(axis=0)

In [ ]:
dfA.mean(axis=1)

In [ ]:
dfA["Mon"].mean()

In [ ]:
dfA.var(axis=0)

In [ ]:
dfA.var(axis=1)

In [ ]:
dfA.std(axis=1)

In [ ]:
dfA["Mon"].std()

In [ ]:
dfA.describe()

In [ ]:
dfA["Mon"].describe()

In [ ]:
dfA.corr()

In [ ]:
dfA.cov()

<a name="5"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">5. Визуализация данных</div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) построение графиков (plot)</i><br> 
b) построение гистограмм<br> 
</p>
</div>

<a name="5a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. График (plot)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#5">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#5b">Далее</a></div>
    </div>
</div>

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
dfA

In [ ]:
dfA.T.plot(style='o-')
plt.title('TV vs Smartphone')
plt.grid(True)
plt.xlabel("Day of the Week")
plt.ylabel("Count")
plt.show()

In [ ]:
fig, ax = plt.subplots(1, 1)
ax.set_title('TV vs Smartphone')
ax = dfA.T.plot.line(style='o-', ax=ax)
ax.set_xlabel("Day of the Week")
ax.set_ylabel("Count")
ax.grid(True)

In [ ]:
ax = dfA.T[['TV', 'Smartphone']].plot(style='o-', title='TV vs Smartphone')
ax.set_xlabel("Day of the Week")
ax.set_ylabel("Count")
ax.grid(True)

<a name="5b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Гистограмма</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#5a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#6">Далее</a></div>
    </div>
</div>

In [ ]:
hists = dfA.hist(
    bins=10, 
    color="orange", 
    figsize=(12,8), 
    density=False, 
    sharex=False
)
plt.tight_layout()
plt.show()

In [ ]:
hist = dfA.T.hist(bins=4)
plt.tight_layout()

In [ ]:
hist = dfA.plot.hist(bins=10, alpha=0.5)

<a name="6"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">6. Источники</div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div><p>Документация</p>
<a href="https://pandas.pydata.org/pandas-docs/version/0.25.1/index.html">Pandas 0.25.1 documentation. Index</a><br>

<p>Разбор функциональных возможностей</p>
<a href="http://pandas.pydata.org/pandas-docs/stable/dsintro.html">Intro to Data Structures</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/indexing.html">Indexing and Selecting Data</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/io.html">IO Tools (Text, CSV, HDF5, ...)</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/groupby.html">Group By: split-apply-combine</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/advanced.html">MultiIndex / Advanced Indexing</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/merging.html">Merge, join, and concatenate</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/merging.html">Essential Basic Functionality</a><br>
<a href="https://s3.amazonaws.com/quandl-static-content/Documents/Quandl+-+Pandas,+SciPy,+NumPy+Cheat+Sheet.pdf">NumPy / SciPy / Pandas Cheat Sheet</a><br>
<a href="http://www.swegler.com/becky/blog/2014/08/06/useful-pandas-snippets/">Useful Pandas Snippets</a><br>
<a href="http://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html">Applying Operations Over pandas Dataframes</a><br>
<a href="http://nbviewer.jupyter.org/urls/bitbucket.org/hrojas/learn-pandas/raw/master/lessons/01%20-%20Lesson.ipynb">Pandas. Lesson 1</a><br>
<a href="http://chrisalbon.com/python/pandas_dropping_column_and_rows.html">Dropping Rows And Columns In pandas Dataframe</a><br>
<a href="http://chrisalbon.com/python/pandas_dataframe_descriptive_stats.html">Descriptive Statistics For pandas Dataframe</a><br>

<p>Примеры использования</p>
<a href="http://synesthesiam.com/posts/an-introduction-to-pandas.html">An Introduction to Pandas (weather analysis)</a><br>
<a href="http://pbpython.com/excel-pandas-comp.html">Common Excel Tasks Demonstrated in Pandas</a><br>
<a href="http://wavedatalab.github.io/datawithpython/aggregate.html">Using Pandas for Analyzing Data - Grouping and Aggregating</a><br>
<a href="http://dataconomy.com/14-best-python-pandas-features/">14 BEST PYTHON PANDAS FEATURES</a><br>
<a href="http://www.randalolson.com/2012/08/06/statistical-analysis-made-easy-in-python/">Statistical analysis made easy in Python with SciPy and pandas DataFrames</a><br>
</div>